<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"c3f4ddaa5109d02d9840c76565fb9a8e36d55cbd8ba3631a47452779e4e30fac","plan_job_ref":"Job Run Terraform plan in staging #73 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/11296265846","plan_out_hash":"849ffa4a455e0f3d7fe9d6011d12d60034d8ff2bbe54edb822c21a78bf31848e","plan_hash":"315b63275588ef640a74238bf4170f1d8111bfe0ea2bb83d751c20c4ac7a0f18","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/staging__
<details>
<summary>Plan: 10 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.app_space.cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh                = (known after apply)
+       auditors                 = (known after apply)
+       delete_recursive_allowed = true
+       developers               = (known after apply)
+       id                       = (known after apply)
+       managers                 = (known after apply)
+       name                     = "rahearn"
+       org                      = "f0a46189-6f64-43fb-99c3-0719cf9ee255"
    }

  # module.app_space.cloudfoundry_space_users.space_permissions will be created
+   resource "cloudfoundry_space_users" "space_permissions" {
+       auditors   = (known after apply)
+       developers = [
+           "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
+           "f262cde6-bb65-461d-a2f0-4889b5564946",
        ]
+       force      = false
+       id         = (known after apply)
+       managers   = [
+           "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
+           "f262cde6-bb65-461d-a2f0-4889b5564946",
        ]
+       space      = (known after apply)
    }

  # module.database.data.cloudfoundry_service.rds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service" "rds" {
+       id                  = (known after apply)
+       name                = "aws-rds"
+       service_broker_name = (known after apply)
+       service_plans       = (known after apply)
    }

  # module.database.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
+       id       = (known after apply)
+       name     = "rahearn"
+       org      = (known after apply)
+       org_name = "gsa-tts-devtools-prototyping"
+       quota    = (known after apply)
    }

  # module.database.cloudfoundry_service_instance.rds will be created
+   resource "cloudfoundry_service_instance" "rds" {
+       id                             = (known after apply)
+       name                           = "continuous_monitoring-rds-staging"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = (known after apply)
+       space                          = (known after apply)
+       tags                           = []
    }

  # module.egress_proxy.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       domain   = (known after apply)
+       id       = (known after apply)
+       internal = (known after apply)
+       name     = "apps.internal"
+       org      = (known after apply)
    }

  # module.egress_proxy.data.cloudfoundry_space.client_space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "client_space" {
+       id       = (known after apply)
+       name     = "rahearn"
+       org      = (known after apply)
+       org_name = "gsa-tts-devtools-prototyping"
+       quota    = (known after apply)
    }

  # module.egress_proxy.data.cloudfoundry_space.egress_space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "egress_space" {
+       id       = (known after apply)
+       name     = "rahearn-egress"
+       org      = (known after apply)
+       org_name = "gsa-tts-devtools-prototyping"
+       quota    = (known after apply)
    }

  # module.egress_proxy.data.external.proxyzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "proxyzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-proxy.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy"
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be created
+   resource "cloudfoundry_app" "egress_app" {
+       buildpack                       = "binary_buildpack"
+       command                         = "./caddy run --config Caddyfile"
+       disk_quota                      = (known after apply)
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "port"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 2
+       memory                          = 64
+       name                            = "tfm-egress-proxy-staging"
+       path                            = (known after apply)
+       ports                           = (known after apply)
+       source_code_hash                = (known after apply)
+       space                           = (known after apply)
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # module.egress_proxy.cloudfoundry_route.egress_route will be created
+   resource "cloudfoundry_route" "egress_route" {
+       domain   = (known after apply)
+       endpoint = (known after apply)
+       hostname = "ts-devtools-prototyping-rahearn-egress-tfm-egress-proxy-staging"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = (known after apply)
    }

  # module.egress_proxy.cloudfoundry_user_provided_service.credentials will be created
+   resource "cloudfoundry_user_provided_service" "credentials" {
+       credentials = (sensitive value)
+       id          = (known after apply)
+       name        = "tfm-egress-proxy-staging-creds"
+       space       = (known after apply)
    }

  # module.egress_proxy.random_password.password will be created
+   resource "random_password" "password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.egress_proxy.random_uuid.username will be created
+   resource "random_uuid" "username" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.egress_space.cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh                = (known after apply)
+       auditors                 = (known after apply)
+       delete_recursive_allowed = true
+       developers               = (known after apply)
+       id                       = (known after apply)
+       managers                 = (known after apply)
+       name                     = "rahearn-egress"
+       org                      = "f0a46189-6f64-43fb-99c3-0719cf9ee255"
    }

  # module.egress_space.cloudfoundry_space_users.space_permissions will be created
+   resource "cloudfoundry_space_users" "space_permissions" {
+       auditors   = (known after apply)
+       developers = [
+           "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
+           "f262cde6-bb65-461d-a2f0-4889b5564946",
        ]
+       force      = false
+       id         = (known after apply)
+       managers   = [
+           "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
+           "f262cde6-bb65-461d-a2f0-4889b5564946",
        ]
+       space      = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #73](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/11296265846)